---
title: Point
classe: Autodesk.Revit.DB.Point
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GeometryObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Point

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Coord { get; }` | `point.Coord` | XYZ |
| `Reference Reference { get; }` | `point.Reference` | Reference |
| `Point Create(XYZ, ElementId)` | `Point.Create(coord, id)` | Point |
| `Point Create(XYZ)` | `Point.Create(coord)` | Point |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```